{"intents": [
        {"tag": "greeting",
         "responses": ["Hi there.How have you been feeling today?", "Hey how are you holding up?", "In your mind, what brings you here today?","How have you felt over the past couple of days?","Have you been to therapy before or seeked help from someone?", "Hello", "Are you having a Good day?"],
         "patterns": ["Hello, thanks for asking", "Good to see you again", "Hi there, how can I help?"],
         "context": [""]
        },


        {"tag": "Kindness",
         "responses": ["We all have problems or challenges that we face. Are you an optimist or a pessimist?", "Tell me how you feel when a problem pops up unexpectedly?", "Describe your typical daily mood. Is your mood like a roller coaster, or is it pretty steady?", "How you can I be helpful?", "What energizes you and makes you feel more upbeat?","What brings you down or makes you feel blue?",
"On a scale of 0-10, how content are you with your life?",
"What keeps happening repeatedly that frustrates you?",
"What do people keep doing that you dislike, and what do you wish they would change?",
"How do you typically handle irritations, aggravations and frustrations?",
"Do you get mad easily?",
"How does your anger come out? Are you carrying any baggage or resentments from your past?",
"What wrongs have been done to you that you haven’t forgiven and still upset you",
"What changes could someone make that would really make you happy?",
"What has been a major life disappointment?"],
         "patterns": ["I can guide you through Adverse drug reaction list, Blood pressure tracking, Hospitals and Pharmacies", "Offering support for Adverse drug reaction, Blood pressure, Hospitals and Pharmacies"],
         "context": [""]
        },
        {"tag": "Help",
         "patterns": ["I am facing problems in my life"],
         "responses": ["How do you see the problem?","What are the things or people in your life that are causing problems for you?",
            "How does this problem typically make you feel?","Do you feel sad, mad, hopeless, stuck, or something else?",
            "What else do you feel? Tell me more","Have you ever had a panic attack?",
            "What sensations were you having physically and emotionally during the attack?",
            "Have you ever had a brief period when you felt intensely fearful or distressed? What was that like?"],
         "context": [""]
        },
        {"tag": "Diagnosing",
         "patterns": ["Open blood pressure module", "Task related to blood pressure", "Blood pressure data entry", "I want to log blood pressure results", "Blood pressure data management" ],
         "responses": ["We all have problems or challenges that we face. Are you an optimist or a pessimist?",
"Tell me how you feel when a problem pops up unexpectedly?",
"Describe your typical daily mood. Is your mood like a roller coaster, or is it pretty steady?",
"What energizes you and makes you feel more upbeat?",
"What brings you down or makes you feel blue?",
"On a scale of 0-10, how content are you with your life?",
"What keeps happening repeatedly that frustrates you?",
"What do people keep doing that you dislike, and what do you wish they would change?",
"How do you typically handle irritations, aggravations and frustrations?",
"Do you get mad easily?",
"How does your anger come out? Are you carrying any baggage or resentments from your past?",
"What wrongs have been done to you that you haven’t forgiven and still upset you",
"What changes could someone make that would really make you happy?",
"What has been a major life disappointment?",
"Do you feel mad when you don’t get your way or lose control? Who is pulling your strings, and why?",
"Have you been feeling anxious or nervous or been feeling worrisome lately?",
"How much is that bothering you? How long has that been going on?",
"Do you often see yourself having negative thoughts?",
"Is there anything else that has been stressing you out?"],
         "context": [""]
        },
        {"tag": "Distract",
         "patterns": ["I want to search for blood pressure result history", "Blood pressure for patient", "Load patient blood pressure result", "Show blood pressure results for patient", "Find blood pressure results by ID" ],
         "responses":["How about we talk about your family and friends for a while?"," Tell me about the important relationships in your life.",
"Tell me more about your family. What was it like growing up in your family?",
"What do people keep doing that you dislike, and what do you wish they would change to make you feel better and content"],
         "context": [""]
        },
        {"tag": "Treatment",
         "patterns": [],
         "responses":["If you dont mind let me ask you a few questions...",
                  "Do you have little interest or pleasure in doing things?,",
                  "Do you often feel down, depressed, or hopeless.",
                  "Have you had trouble falling or staying asleep, or sleeping too much.",
                  "Hmmm, do you feel tired or having little energy.",
                  "What about your eating style, do you feel there have been any changes,",
                  "Are you feeling any kind of self doubt,",
                  "Are you maybe having Trouble concentrating on things such as doing something or even your daily activities,",
                  "Are you finding yourself being clouded with negative thoughts"],
         "context": [""]
        },
        {"tag": "encouragement",
         "patterns": ["Find me a pharmacy", "Find pharmacy", "List of pharmacies nearby", "Locate pharmacy", "Search pharmacy" ],
         "responses": [".Never give up on yourself. This sure is a difficult phase in your life, but it shall pass.  History shows that, life has a special way to surprise people with great souls and sincere efforts. You sure will do great and be better.",
                  "I see great potential in you. You are not for everyone but for those who witness the beauty in you. I genuinely in believe in you as much as you have faith in yourself.",
                  "Everything shall pass. The bright and the dark events. Life has never been easy and don’t ever expect it to be. But, prepare yourself to become gently sharp and wildly calm just to defend yourself. You’ll have to dust yourself up and do this for yourself. ",
                  "You are never alone. We’ll be in this together. Be free to open up. You will feel much better when you share it. You can always think of this as your special place to come and talk about your happenings in life. ",
                  "Don’t feel sorry for being sad. Feel as deep as you can. The more sensitive we are, the greater understanding and powerful connection we possess for everything we care.",
                  "You’re bold, you really are. Its strong of you to come here and vent about your problems and the things that make you feel sad. Difficult paths always lead to beautiful destinations.",
                  "Sometimes you just need to destroy yourself completely to realize your ignorance and rise again with new perception about life. Therefore, embrace these dark times to understand yourself. Everything makes sense, when you become yourself again. When God closes one door he definitely opens another one.",
                  "The best moment of your life will be that when you realize, your life belongs only to you. Life is a gift. So, be grateful for still breathing, for being healthy and alive",
                  "When you don’t get what you wanted. It’s okay accept it and move on to the chapter without being harsh to yourself. We have one and only one life. So, make use of yourself to accomplish whatever you dream in this very life."],
         "context": [""]
        },
  {"tag": "thanks",
         "patterns": ["Thanks", "Thank you", "That's helpful", "Awesome, thanks", "Thanks for helping me"],
         "responses": ["Thank you, did talking out make you feel less burdensome or relieved?",
"Thank you for that, are you feeling better now?",
"Thank you for that, do you feel like a weight has lifted off yourself."],
         "context": [""]
        },
  {"tag": "goodbye",
         "patterns": ["Bye", "See you later", "Goodbye", "Nice chatting to you, bye", "Till next time"],
         "responses": ["See you!", "Have a nice day", "Bye! Come back again soon."],
         "context": [""]
        }
]}